stress-test/app-stresstest.yml
config:
  target: "http://localhost:5001/api/nearbyworkspaces"
  phases:
    - duration: 5
      arrivalRate: 1
    - duration: 10
      arrivalRate: 10
    - duration: 15
      arrivalRate: 100
    - duration: 60
      arrivalRate: 1000
  payload:
    path: "workspaceIds.csv"
    fields:
      - "workspaceId"
scenarios:
  - flow:
    - get:
        url: "/buildings/{{ workspaceId }}"